:PROPERTIES:
:ID:       3c01fbd0-5270-4a5c-a8c9-591744d6c0ed
:LAST_MODIFIED: [2021-08-11 Wed 16:31]
:END:
#+title: bike tools
#+filetags: project casdu

* 单车常用工具分类
:PROPERTIES:
:id: b424f800-3b15-4c58-8f32-25ab9992199b
:END:
** 通用/General
** 多用/Multi-Tools
** 清洗/Cleaning
** 润滑/Lubricants and Compounds
** [[id:ac93a920-81ef-4038-8a41-672910f3efa8][轮组/Wheel set]]
** [[id:e1a95af6-adef-43d0-ba7a-267aded0f10d][轮胎/Tire]]
   :PROPERTIES:
   :ID:       bde09bba-3319-4199-8d85-9d1d63202a7f
   :END:
** 脚踏/Pedal
** 刹车/Brakes
** 五通/Bottom Bracket
   :PROPERTIES:
   :ID:       0e1a97e2-7996-4f98-8bfc-125743d5752d
   :END:
*** square tapered spindles - 方孔中轴
    :PROPERTIES:
    :ID:       fe898afb-8706-4f01-95bd-8a14bf701f2f
    :END:
*** splined －花键中轴
    :PROPERTIES:
    :ID:       40ad026c-7980-4860-ae4d-6c9cf5b5522a
    :END:
*** 一体中轴
    :PROPERTIES:
    :LAST_MODIFIED: [2021-08-05 Thu 23:16]
    :END:
    :PROPERTIES:
    :ID:       52e39c97-c015-4ce1-9645-1d413be8a45f
    :END:

** [[中轴]]/Crank
** 飞轮/Cassette
   :PROPERTIES:
   :ID:       692d9d1c-b09d-481e-9aeb-eff64b4c2f53
   :END:
** 车架/Frame
:PROPERTIES:
:id: 5fb5c776-e522-42b9-86f1-fb9800b02214
:END:

** 腕组/Headset
** /Bear
https://www.youtube.com/watch?v=hRLbamNQa_0
** /dérailleur
   :PROPERTIES:
   :ID:       db3a2328-e4c0-40b1-b424-247f56e5b182
   :END:
*** front dérailleur
*** rear dérailleur
**** Di2
:PROPERTIES:
:id: 604989f9-c257-41e2-8311-d1c75b02198f
:END:
**** Etab
:PROPERTIES:
:id: 60498a02-44aa-4f97-bdc4-b86f81763f8c
:END:
** Fork
** Chain
   :PROPERTIES:
   :ID:       83d35ca1-df40-4017-b04b-88f7f90a05df
   :END:
*** [[https://youtu.be/9x8JTUa_hZU?t=98][Best homemade chain cleaner - YouTube]]
    - the idea of using kitchen sieve to fix the bike component
*** [[https://www.harborfreight.com/25-liter-ultrasonic-cleaner-63256.html][10 speed chain link on 11-speed chain]]
    :PROPERTIES:
    :ID:       3ce20ad8-5837-4a7b-a4ed-85bd0fc44490
    :END:
    - it's okay but not recommended.
* 按需推荐准备工具
** 单日
** 单周
** 多周
* 大队骑行工具准备
** 单日拉练
** 多日拉练
** [[file:./pages/远征.org][远征]]工具清单
*** [[id:56bbc19f-7228-4fcd-ae66-f4dd1f9a3aa3][2021]]远征工具清单
    :PROPERTIES:
    :LAST_MODIFIED: [2021-08-07 Sat 22:11]
    :END:
*** TODO 21远征队技术员物资 - 2021年远征版-肩扛红色旅游旗，车量百年建党路 - 山东大学自行车协会论坛 - Powered by Discuz!.pdf
    :PROPERTIES:
    :LAST_MODIFIED: [2021-08-07 Sat 22:13]
    :END:
* 工作流

#+begin_export ascii
graph TD
	A[胎压] -->
	| psi? | B(快拆 花鼓 把立)
	B --> C(刹车)
	C --> D(变速)
	D --> E(脚踏 中轴)
	E --> F(前叉)
	F --> G(螺丝)
	G --> H(刹车)
	H --> I(试骑)
#+end_export
* HOLD Overall bike fix tool index                              :table:index:
  CLOSED: [2021-08-02 Mon 22:39]
  :PROPERTIES:
  :ID:       ff18f082-6614-4429-b964-4ba1dd98e707
  :LAST_MODIFIED: [2021-08-05 Thu 22:51]
  :END:
  :LOGBOOK:
  - State "HOLD"       from "DONE"       [2021-08-05 Thu 22:50] \\
    Day 4: 修缮表格
  CLOCK: [2021-08-05 Thu 22:40]--[2021-08-05 Thu 22:50] =>  0:10
  - State "DONE"       from "HOLD"       [2021-08-03 Tue 22:39]
  CLOCK: [2021-08-03 Tue 22:03]--[2021-08-03 Tue 22:39] =>  0:36
  - State "HOLD"       from "TODO"       [2021-08-02 Mon 22:39] \\
    Day 1: 处理到中轴工具
  CLOCK: [2021-08-02 Mon 22:15]--[2021-08-02 Mon 22:39] =>  0:24
  :END:

  Borrow from [[https://www.parktool.com/category/tools][Tools | Park Tool]].

  # Cache 1: most frequently used
  |------------------------+------------------------------------------+---------+---------+---------+---------+--------|
  | Category               |                                    Tools | Cache 1 | Cache 2 | Cache 3 | On bike | bucket |
  |------------------------+------------------------------------------+---------+---------+---------+---------+--------|
  | <l>                    |                                      <r> |     <r> |     <r> |     <r> |         |        |
  |------------------------+------------------------------------------+---------+---------+---------+---------+--------|
  | General tool           |                                          |         |         |         |         |        |
  |------------------------+------------------------------------------+---------+---------+---------+---------+--------|
  |                        |                            [[id:ff85fe02-8a3c-4a58-9910-e879a51e0f7b][pliers - 钳子]] |       x |         |         |         |        |
  |                        |                       [[id:107dd05f-c091-4b5e-a012-ff97381c1ee2][wrench 15mm - 扳手]] |       x |         |         |         |        |
  |                        |        [[id:0ce3064f-30f4-4963-9080-ead23f7a5d5a][phillips screwdriver - 十字螺丝刀]] |       x |         |         |         |        |
  |                        |      [[id:20079ea0-aeb5-4757-b9e3-b9484dccff04][flat blade screwdriver - 一字螺丝刀]] |       x |         |         |         |        |
  |                        |  [[id:757ff8e3-3b26-4e2c-89e5-7465e57e5a12][quick change bit driver set － 组合工具]] |         |         |         | x       |        |
  |------------------------+------------------------------------------+---------+---------+---------+---------+--------|
  | Brake                  |                                          |         |         |         |         |        |
  |------------------------+------------------------------------------+---------+---------+---------+---------+--------|
  |                        |      [[id:86654d0d-4379-4c26-8f38-2b854398612e][cable and housing cutter - 线管工具]] |       x |         |         |         |        |
  |------------------------+------------------------------------------+---------+---------+---------+---------+--------|
  | Cassette & Freewheel   |                                          |         |         |         |         |        |
  |------------------------+------------------------------------------+---------+---------+---------+---------+--------|
  |                        |     [[id:c29bb4f7-d7a4-4389-b90a-5b92f29c0966][cassette locking tool - 飞轮锁死工具]] |       x |         |         |         |        |
  |                        |         [[id:851aeb1f-6a3f-4770-89c2-addd5d19b351][sprocket remover － 固定飞轮工具]] |       x |         |         |         |        |
  |------------------------+------------------------------------------+---------+---------+---------+---------+--------|
  | Chain                  |                                          |         |         |         |         |        |
  |------------------------+------------------------------------------+---------+---------+---------+---------+--------|
  |                        |                     [[id:f14dcbfb-6022-48e7-a594-efc31e373bd7][chain tool － 截链器]] |       x |         |         | x       |        |
  |                        |         [[id:ce0aa37e-b932-4b9e-83b8-4ffa25b6922d][master link pliers － 魔术扣工具]] |       x |         |         |         |        |
  |------------------------+------------------------------------------+---------+---------+---------+---------+--------|
  | Clean                  |                                          |         |         |         |         |        |
  |------------------------+------------------------------------------+---------+---------+---------+---------+--------|
  |                        |    [[id:11d6eb86-09b1-4368-bb73-7dd6474b62cc][nitrile mechanic gloves － 防油渍手套]] |       x |         |         |         |        |
  |                        |  [[id:950f2357-7734-4124-ab27-3430215bf825][cassette cleaning brush － 传动清洗刷子]] |         |         |         |         | x      |
  |                        |                    [[id:199535cb-9781-4bed-9928-ee2f4efae9e0][degreaser － 防止锈脂]] |         |         |         |         | x      |
  |------------------------+------------------------------------------+---------+---------+---------+---------+--------|
  | Crank & Bottom bracket |                                          |         |         |         |         |        |
  |------------------------+------------------------------------------+---------+---------+---------+---------+--------|
  |                        | [[id:8270aa48-b539-40af-8096-462cdf058c40][bottom bracket tool - splined －花键中轴]] |         |         |         |         |        |
  |                        |       [[id:fe898afb-8706-4f01-95bd-8a14bf701f2f][square tapered spindles - 方孔中轴]] |         |         |         |         |        |
  |                        |           [[id:6ad6aa7e-2fe5-4768-b16f-f55a262f8173][bottom bracket tool - 一体中轴]] |         |       x |         |         |        |
  |------------------------+------------------------------------------+---------+---------+---------+---------+--------|
  | Hex                    |                                          |         |         |         |         |        |
  |------------------------+------------------------------------------+---------+---------+---------+---------+--------|
  |                        |   [[id:20c06312-3908-46d7-8591-fb987b8f4fb4][p-handle hex wrench 4mm  - 四号P型六角]] |       x |         |         |         |        |
  |                        |  [[id:a5da44b5-d072-4222-8633-1a0dc1fab525][p-handle hex wrench 5mm  － 五号P型六角]] |       x |         |         |         |        |
  |------------------------+------------------------------------------+---------+---------+---------+---------+--------|
  | Lubricants             |                                          |         |         |         |         |        |
  |------------------------+------------------------------------------+---------+---------+---------+---------+--------|
  |                        |                 [[id:1d98e56a-8c65-4131-beaf-326079c008ae][bio chainbrite™ - 链条油]] |         |         |         |         |        |
  | Pumps                  |                                          |         |         |         |         |        |
  |------------------------+------------------------------------------+---------+---------+---------+---------+--------|
  |                        |                  [[id:963cfe0a-ed06-4e00-a29c-9a76f222c963][floor pump - 地板打气筒]] |         |         |         |         |        |
  |                        |                    [[id:d68e955e-db3f-4a8a-ac99-caa09652f974][fork pump － 前叉气筒]] |         |         |         |         |        |
  |                        |                  [[id:d8dc3d4d-a6d8-4b6d-b145-f54b9aa91ba7][pocket pump － 便携气筒]] |         |         |         | x       |        |
  |------------------------+------------------------------------------+---------+---------+---------+---------+--------|
  | Wheel & Spoke          |                                          |         |         |         |         |        |
  |------------------------+------------------------------------------+---------+---------+---------+---------+--------|
  |                        |                  [[id:4a8e97e8-9b40-4033-bc83-53baf2c92187][spoke wrench - 辐条扳手]] |       x |         |         |         |        |
  |------------------------+------------------------------------------+---------+---------+---------+---------+--------|
  | Hub & axle             |                                          |         |         |         |         |        |
  | Headset                |                                          |         |         |         |         |        |
  | Frame & fork           |                                          |         |         |         |         |        |
  |------------------------+------------------------------------------+---------+---------+---------+---------+--------|

* bike tools index － 自行车工具总览                                    :MOC:
  :PROPERTIES:
  :ID:       84de1552-916e-4f66-b355-0c577439161b
  :LAST_MODIFIED: [2021-08-05 Thu 22:35]
  :END:
** spoke wrench - 辐条扳手
:PROPERTIES:
:id: 4a8e97e8-9b40-4033-bc83-53baf2c92187
:END:
** fork pump － 前叉气筒
   :PROPERTIES:
   :ID:       d68e955e-db3f-4a8a-ac99-caa09652f974
   :LAST_MODIFIED: [2021-08-05 Thu 22:45]
   :END:

** pocket pump － 便携气筒
   :PROPERTIES:
   :ID:       d8dc3d4d-a6d8-4b6d-b145-f54b9aa91ba7
   :END:

** floor pump - 地板打气筒
   :PROPERTIES:
   :ID:       963cfe0a-ed06-4e00-a29c-9a76f222c963
   :END:

** bio chainbrite™ - 链条油
   :PROPERTIES:
   :ID:       1d98e56a-8c65-4131-beaf-326079c008ae
   :LAST_MODIFIED: [2021-08-05 Thu 22:44]
   :END:

** p-handle hex wrench 4mm  - 四号P型六角
   :PROPERTIES:
   :ID:       20c06312-3908-46d7-8591-fb987b8f4fb4
   :END:

** p-handle hex wrench 5mm  － 五号P型六角
   :PROPERTIES:
   :ID:       a5da44b5-d072-4222-8633-1a0dc1fab525
   :END:

** quick change bit driver set － 组合工具
   :PROPERTIES:
   :ID:       757ff8e3-3b26-4e2c-89e5-7465e57e5a12
   :END:

** phillips screwdriver - 十字螺丝刀
   :PROPERTIES:
   :ID:       0ce3064f-30f4-4963-9080-ead23f7a5d5a
   :END:
** flat blade screwdriver - 一字螺丝刀
   :PROPERTIES:
   :ID:       20079ea0-aeb5-4757-b9e3-b9484dccff04
   :END:
** wrench 15mm - 扳手
   :PROPERTIES:
   :ID:       107dd05f-c091-4b5e-a012-ff97381c1ee2
   :END:
** pliers - 钳子
   :PROPERTIES:
   :ID:       ff85fe02-8a3c-4a58-9910-e879a51e0f7b
   :END:
** cable and housing cutter - 线管工具
   :PROPERTIES:
   :ID:       86654d0d-4379-4c26-8f38-2b854398612e
   :END:
** cassette locking tool - 飞轮锁死工具
   :PROPERTIES:
   :ID:       c29bb4f7-d7a4-4389-b90a-5b92f29c0966
   :END:
** sprocket remover － 固定飞轮工具
   :PROPERTIES:
   :ID:       851aeb1f-6a3f-4770-89c2-addd5d19b351
   :END:
** chain tool － 截链器
   :PROPERTIES:
   :ID:       f14dcbfb-6022-48e7-a594-efc31e373bd7
   :END:
** master link pliers － 魔术扣工具
   :PROPERTIES:
   :ID:       ce0aa37e-b932-4b9e-83b8-4ffa25b6922d
   :END:
** nitrile mechanic gloves － 防油渍手套
   :PROPERTIES:
   :ID:       11d6eb86-09b1-4368-bb73-7dd6474b62cc
   :END:
** cassette cleaning brush － 传动清洗刷子
   :PROPERTIES:
   :ID:       950f2357-7734-4124-ab27-3430215bf825
   :END:
** degreaser － 防止锈脂
   :PROPERTIES:
   :ID:       199535cb-9781-4bed-9928-ee2f4efae9e0
   :LAST_MODIFIED: [2021-08-05 Thu 22:47]
   :END:
** bottom bracket tool - [[id:40ad026c-7980-4860-ae4d-6c9cf5b5522a][splined －花键中轴]]
   :PROPERTIES:
   :ID:       8270aa48-b539-40af-8096-462cdf058c40
   :END:
** bottom bracket tool - [[id:fe898afb-8706-4f01-95bd-8a14bf701f2f][square tapered spindles - 方孔中轴]]
   :PROPERTIES:
   :ID:       6adb0b74-e643-4981-891e-1b97bf581043
   :END:
** bottom bracket tool - [[id:52e39c97-c015-4ce1-9645-1d413be8a45f][一体中轴]]
   :PROPERTIES:
   :ID:       6ad6aa7e-2fe5-4768-b16f-f55a262f8173
   :LAST_MODIFIED: [2021-08-05 Thu 22:34]
   :END:

* 参考资料
  :PROPERTIES:
  :LAST_MODIFIED: [2021-08-05 Thu 22:35]
  :END:
- https://www.parktool.com/product/docs
- searchable tutorial https://www.parktool.com/blog/repair-help
